OpenFOAM-v1812/tutorials/incompressible/pimpleFoam/laminar/filmPanel0/0.orig/hf_film
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       areaScalarField;
    location    "0";
    object      h_film;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type    fixedValue;
        value   uniform 1e-3;
    }

    outlet
    {
        type    zeroGradient;
    }

    side
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
        phi         phi2s_film;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
